SM_для_EDT/src/Catalogs/рарусСвидетельстваСудов/рарусСвидетельстваСудов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>рарусСвидетельстваСудов</name>
  <owners>Catalog.vftСуда</owners>
  <attributes>
    <name>Сертификат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.рарусВидыДокументовОсвидетельствования</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОсвидетельствования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодтвердитьДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Значения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ежегодный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бессрочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригиналДубликат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.впОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СлужебныйПризнак</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьГрузов</name>
    <attributes>
      <name>Груз</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ГрузовоеПомещение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

SM_для_EDT/src/Catalogs/рарусСвидетельстваСудов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Владелец ТОЛЬКО Справочник.vftСуда)";
	

КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция НайтиПрисоедененныйФайлДокумента(ВладелеФайла) Экспорт
	
	
	
	
	
КонецФункции
// ++ rarus yukuzi 17.09.2021   //
Функция ТекстЗапросаСписка()  Экспорт
ТекстЗапроса = "
	|ВЫБРАТЬ
	|	СвидетельстваСудов.Ссылка КАК Ссылка,
	|	СвидетельстваСудов.ПометкаУдаления КАК ПометкаУдаления,
	|	СвидетельстваСудов.Владелец КАК Владелец,
	|	СвидетельстваСудов.Код КАК Код,
	|	СвидетельстваСудов.Наименование КАК Наименование,
	|	СвидетельстваСудов.Сертификат КАК Сертификат,
	|	СвидетельстваСудов.ВидДокумента КАК ВидДокумента,
	|	СвидетельстваСудов.ТипОсвидетельствования КАК ТипОсвидетельствования,
	|	СвидетельстваСудов.ДатаВыдачи КАК Дата,
	|	ЕСТЬNULL(СвидетельстваСудов.СрокДействия, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокДействия,
	|	СвидетельстваСудов.ПодтвердитьДо КАК ПодтвердитьДо,
	|	СвидетельстваСудов.Организация КАК Организация,
	|	СвидетельстваСудов.Значения КАК Значения,
	|	СвидетельстваСудов.Ежегодный КАК Ежегодный,
	|	СвидетельстваСудов.Примечение КАК Примечение,
	|	СвидетельстваСудов.ВАрхиве КАК ВАрхиве,
	|	СвидетельстваСудов.ОригиналДубликат КАК ОригиналДубликат,
	|	ЕСТЬNULL(СвидетельстваСудов.Оборудование, ЗНАЧЕНИЕ(Справочник.впОбъектыРемонта.ПустаяСсылка)) КАК Оборудование,
	|	СвидетельстваСудов.НомерДокумента КАК НомерДокумента,
	|	СвидетельстваСудов.Комментарий КАК Комментарий,
	|	СвидетельстваСудов.Предопределенный КАК Предопределенный,
	|	СвидетельстваСудов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных,
	|	СвидетельстваСудов.ВидДокумента.ГруппаСудов КАК ГруппаСудов,
	|	СвидетельстваСудов.ВидДокумента.КодФормы КАК КодФормы,
	|	СвидетельстваСудов.ВидДокумента.ЗонаОтветственности КАК ЗонаОтветственности,
	|	СвидетельстваСудов.ВидДокумента.Комментарий КАК Описание,
	|	ВЫБОР
	|		КОГДА СвидетельстваСудов.ВидДокумента.ИмеетСрокДействия
	|			ТОГДА -РАЗНОСТЬДАТ(ЕСТЬNULL(СвидетельстваСудов.СрокДействия, ДАТАВРЕМЯ(1, 1, 1)), &ТекущаяДата, МЕСЯЦ)
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДатаДляОформления,
	// ++ rarus yukuzi 16.09.2021   //
	|ВЫБОР
	|	КОГДА СвидетельстваСудов.ВидДокумента.ИмеетСрокДействия и ЕСТЬNULL(СвидетельстваСудов.СрокДействия, ДАТАВРЕМЯ(1, 1, 1)) <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 1)
	|		ТОГДА истина
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК СрокМенееМесяца,
	|ВЫБОР
	|	КОГДА СвидетельстваСудов.ВидДокумента.КоличествоДнейДоУведомления =0 и СвидетельстваСудов.ВидДокумента.ИмеетСрокДействия и ЕСТЬNULL(СвидетельстваСудов.СрокДействия, ДАТАВРЕМЯ(1, 1, 1)) <= ДОБАВИТЬКДАТЕ(&ТекущаяДата, МЕСЯЦ, 3)
	|		ТОГДА истина
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК СрокМенее3Месяцев,
	|ВЫБОР
	|	КОГДА СвидетельстваСудов.ВидДокумента.ИмеетСрокДействия
	|	и (не СвидетельстваСудов.ВидДокумента.КоличествоДнейДоУведомления =0 и
	|			 -РАЗНОСТЬДАТ(ЕСТЬNULL(СвидетельстваСудов.СрокДействия, ДАТАВРЕМЯ(1, 1, 1)), &ТекущаяДата, ДЕНЬ) - СвидетельстваСудов.ВидДокумента.КоличествоДнейДоУведомления < 0)
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК ПрошелСрокДоУведомления,
	|ВЫБОР
	|	КОГДА не СвидетельстваСудов.ВидДокумента.КоличествоДнейДоУведомления =0
	|		ТОГДА ИСТИНА
	|	ИНАЧЕ ЛОЖЬ
	|КОНЕЦ КАК ЗаполненоКоличествоДнейУведомления,
	// -- rarus yukuzi 16.09.2021
	|	ВЫБОР
	|		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	|			ТОГДА 0
	|		КОГДА НаличиеФайлов.ЕстьФайлы
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ЕстьФайлы,
	|	Не СвидетельстваСудов.ВидДокумента.ИмеетСрокДействия КАК Бессрочно,
	|	СвидетельстваСудов.ВидДокумента.ИмеетСрокДействия КАК УчитыватьСрокДействия,
	//rarus_AfoD 27.04.2021 < 
	|	СвидетельстваСудов.СлужебныйПризнак КАК Служебный,
	//rarus_AfoD 27.04.2021 > 
	|	ВЫБОР
	|		КОГДА СвидетельстваСудов.СлужебныйПризнак
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК ЕстьСлужебный		
	|ИЗ
	|	Справочник.рарусСвидетельстваСудов КАК СвидетельстваСудов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	|		ПО СвидетельстваСудов.Ссылка = НаличиеФайлов.ОбъектСФайлами
	|ГДЕ
	|	&УсловиеОтбора
	|";
Возврат ТекстЗапроса;
	

КонецФункции // ()
// -- rarus yukuzi 17.09.2021

#КонецОбласти 

#Область Отчеты

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = Отчеты.рарусДокументыСудна.ДобавитьКомандуОтчета(КомандыОтчетов); 
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаСписка";
		КомандаОтчет.Порядок = 1;
	КонецЕсли;
	// ++ rarus zalikh 2021-05-20 [27019]
	КомандаОтчет = Отчеты.рарусОтчетПоСудовымСвидетельствам.ДобавитьКомандуОтчета(КомандыОтчетов); 
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаСписка";
		КомандаОтчет.Порядок = 2;
	КонецЕсли;
	// -- rarus zalikh 2021-05-20 [27019]
КонецПроцедуры

#КонецОбласти



#КонецЕсли
